import fs from 'fs'
import fetch from 'node-fetch'
import { xpRange } from '../lib/levelling.js'
const { levelling } = '../lib/levelling.js'
import PhoneNumber from 'awesome-phonenumber'
import { promises } from 'fs'
import { join } from 'path'
let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems }) => {
try {
let vn = './LOYD1.mp4'
let pp = imagen4
let img = await(await 
                
let handler = async (m, { conn, command, text }) => {
let love = `
❆╼━━━━❆ •﹝👑﹞• ❆━━━━╾❆
*❮ اهلا بك في اوامـر بوت 'رايلي'🤖❯*

*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*
*↵ ❲  قـائـمـة المجموعات ❳ ⬳ ⌝🥏⌞*
*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*

*❬👑❭↜ 〚.منشن〛*
*〈البوت يمنشن الجميع〉*

*❬👑❭↜ 〚.المشرفين〛*
*〈البوت يمنشن المشرفين〉*

*❬👑❭↜ 〚.مخفي〛*
*〈البوت يمنشن بطريقة وهمية〉*

*❬👑❭↜ 〚.طرد〛*
*〈البوت يطرد الي منشنته〉*

*❬👑❭↜ 〚.تغييرالترحيب〛*
*〈البوت يغير دخول شخص〉*

*❬👑❭↜ 〚.تغييرالمغادره〛*
*〈البوت يغير خروج شخص〉*

*❬👑❭↜ 〚.ترقية〛*
*〈البوت يرفع الي منشنته مشرف〉*

*❬👑❭↜ 〚.تخفيض〛*
*〈البوت ياخذ اشراف الي منشنته〉*

*❬👑❭↜ 〚.اللينك〛*
*〈البوت يعطيك رابط الجروب〉*

*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*
*↵ ❲  قـائـمـة  التحـمـيل ❳ ⬳ ⌝📥⌞*
*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*

*❬👑❭↜ 〚.فيسبوك〛*
*〈البوت يحمل لك الفيديو〉*

*❬👑❭↜ 〚.شغل〛*
*〈البوت رح يجيب حسب طلبك〉*

*❬👑❭↜ 〚.فيديو〛*
*〈البوت يجيب فيديو لطلبك〉*

*❬👑❭↜ 〚.البحث〛*
*〈البوت يبحث عن طلبك〉*

*❬👑❭↜ 〚.تيك〛*
*〈البوت يحمل فيديو التيك〉*

*❬👑❭↜ 〚.صوره〛*
*〈البوت يجب صورة لطلبك〉*

*❬👑❭↜ 〚.انستا〛*
*〈البوت يحمل رابط فيديو الانستا〉*

*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*
*↵ ❲  قـائـمـة الـتـرفـيـه ❳ ⬳ ⌝🎮⌞*
*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*

*❬👑❭↜ 〚.زواج〛*
*〈البوت يمنشن اثنين يزوجهم〉*

*❬👑❭↜ 〚.اكس〛*
*〈البوت يفتح غرفة لعب جديدة〉*

*❬👑❭↜ 〚.شاذ〛*
*〈البوت يمنشن شخص عشوائي〉*

*❬👑❭↜ 〚.سيمب〛*
*〈البوت يمنشن شخص عشوائي〉*

*❬👑❭↜ 〚.نسبة〛*
*〈البوت يحدد النسبة بحسب طلبك〉*

*❬👑❭↜ 〚.غباء〛*
*〈البوت يمنشن شخص عشوائي〉*

*❬👑❭↜ 〚.تحدث〛*
*〈البوت يحكي〉*

*❬👑❭↜ 〚.انطق〛*
*〈البوت ينطق طلبك〉*

*❬👑❭↜ 〚.لوغو〛*
*〈البوت يعطيك لوغو لطلبك〉*

*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*
*↵ ❲  قـائـمـة الـتحـويـل ❳ ⬳ ⌝🎴⌞*
*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*

*❬👑❭↜ 〚.ملصق〛*
*〈البوت يحول صورة لملصق〉*

*❬👑❭↜ 〚.ستيكر〛*
*〈البوت يحول صورة لملصق〉*

*❬👑❭↜ 〚.سرقه〛*
*〈البوت يعطيك الملصق بحقوقك〉*

*❬👑❭↜ 〚.حيوان〛*
*〈البوت يعطيك ملصق حيوان〉*

*❬👑❭↜ 〚.ستكر〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستكر2〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستكر3〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستك〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستك2 •*
〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستك3〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ستك4〛*
*〈البوت يعطيك شكل مختلف〉*

*❬👑❭↜ 〚.ترجم〛*
*〈البوت يترجم لغة معينة〉*

*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙ •*
*↵ ❲  قـائـمـة الاعـضــاء ❳ ⬳ ⌝👥⌞*
*• ∙ ∙ ━━╍━━﹝👑﹞━━╍━━ ∙ ∙

*❬👑❭↜ 〚.البروفايل〛*
*〈البوت يعطي معلوماتك〉*

*❬👑❭↜ 〚.المطور〛*
*〈البوت يعرض رقم المطور〉*

*❬👑❭↜ 〚.الدعم〛*
*〈البوت يعرض قروب دعم〉*

*❬👑❭↜ 〚.شرح〛*
*〈شرح اوامر البوت〉*

*❬👑❭↜ 〚.البوت〛*
*〈معلومات عن البوت〉*

*❬👑❭↜ 〚.طقم〛*
*〈البوت يعطيك تطقيم〉*

❆╼━━━━❆ •﹝👑﹞• ❆━━━━╾❆
 `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(شرح|الشرح)$/i
export default handler


  let buttonMessage = {
  image: pp,
  caption: str.trim(),
  mentions: [m.sender],
  footer: `*${wm}*`,
  headerType: 4,
  contextInfo: {
  mentionedJid: [m.sender],
  externalAdReply: {
  showAdAttribution: true,
  mediaType: 'VIDEO',
  mediaUrl: null,
  title: '〘 𝐵𝛩𝑇╎💰╎𝐿𝛩𝑌𝐷〙',
  body: null,
  thumbnail: img,
  sourceUrl: 